Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: For information about how to define a custom formatting string, see Date Formatters in Data Formatting Guide.
ja: あつらえの書式設定文字列を定義する方法についての情報として、Date FormattersをData Formatting Guideで見てください。

source: For information about the Apple Event Manager, see Apple Event Manager and Apple Events Programming Guide.
ja: アップルイベントマネージャについての情報として、Apple Event Managerと「アップルイベントプログラミングガイド」を見てください。

source: For information about the bundle structure of iOS and macOS apps, see Bundle Programming Guide.
ja: iOSとmacOSアプリのバンドル構造についての情報として、Bundle Programming Guideを見てください。

source: For information about the structure of framework bundles, see Framework Programming Guide.
ja: フレームワークバンドル構造についての情報として、Framework Programming Guideを見てください。

source: For information about the structure of macOS plug-ins, see Code Loading Programming Topics.
ja: macOSプラグインの構造についての情報として、Code Loading Programming Topicsを見てください。

source: For instance, if the is Adaptive algorithm is used, this option formats 1.19 and 1.2 GB as 1 .19 GB and 1 .20 GB, respectively, while without the option the latter would be displayed as 1 .2 GB.
ja: 例えば、is Adaptiveアルゴリズムが使われるならば、このオプションは、1.19 と 1.2 GB を 1 .19 GB と 1 .20 GBのようにそれぞれ書式化します、一方オプション無しでは文字は1 .2 GBのように表示されるでしょう。

source: For instance, you may need a custom unit type to represent a derived unit, such as magnetic flux (measured as the product of electric potential difference and time).
ja: 例えば、あなたはあつらえの単位型をある組立単位、例えば磁束（電位差と時間の積として測定される）を表すために必要とするかもしれません。

source: For instance, you might want negative values in a financial application to appear in red text.
ja: 例えば、あなたは負の値が財務アプリケーションにおいて赤いテキストで現れることを望むかもしれません。

source: For instructions on how to create your own custom formatter, see Creating a Custom Formatter.
ja: あなた独自のあつらえのフォーマッタを作成する方法に関する説明書として、Creating a Custom Formatterを見てください。

source: For more control over the exact behavior, use next Date(after: matching: matching Policy: behavior: direction:).
ja: さらに正確な挙動を管理するために、next Date(after: matching: matching Policy: behavior: direction:)を使ってください。

source: For more details on how localized resources are found, read The Bundle Search Pattern in Bundle Programming Guide.
ja: どのようにローカライズされたリソースが見つけられるかに関する詳細は、The Bundle Search PatternをBundle Programming Guideで読んでください。

source: For more details see The Bundle Search Pattern in Bundle Programming Guide.
ja: 詳細としてThe Bundle Search PatternをBundle Programming Guideで見てください。

source: For more details, see Predicate Programming Guide.
ja: 詳細として、プレディケート プログラミングガイドを見てください。

source: For more details, see Low-Level File Management Programming Topics.
ja: さらなる詳細として、Low-Level File Management Programming Topicsを見てください。

source: For more information about blocks, see Blocks Programming Topics.
ja: ブロックについてのさらなる情報として、Blocks Programming Topicsを見てください。

source: For more information about configuring and using run loops, see Threading Programming Guide.
ja: 実行ループの構成設定と使用についてのさらなる情報として、Threading Programming Guideを見てください。

source: For more information about temporary files, see File System Programming Guide.
ja: 一時的ファイルについてのさらなる情報として、File System Programming Guideを見てください。

source: For more information about the container types used when customizing the encoding and decoding process, see Keyed Encoding Container Protocol and Unkeyed Encoding Container.
ja: デコーディングとエンコーディング過程をカスタマイズする時に使われるコンテナ型についての詳細は、Keyed Encoding Container ProtocolとUnkeyed Encoding Containerを見てください。

source: For more information on Nibs, see NSNib.
ja: Nibに関するさらなる情報として、NSNibを見てください。

source: For more information on event classes and event IDs, see Building an Apple Event in Apple Events Programming Guide.
ja: イベントクラスとイベントIDに関するさらなる情報として、「Building an Apple Event」をApple Events Programming Guideで見てください。

source: For more information on file system race conditions, see Race Conditions and Secure File Operations in Secure Coding Guide.
ja: ファイルシステム競合状態に関するさらなる情報として、Race Conditions and Secure File OperationsをSecure Coding Guideで見てください。

source: For more information on file system utilities, see Low-Level File Management Programming Topics.
ja: ファイルシステムユーティリティに関する詳細情報として、Low-Level File Management Programming Topicsを見てください。

source: For more information on file-system race conditions, see Race Conditions and Secure File Operations in Secure Coding Guide.
ja: ファイル-システム競合状態に関するさらなる情報として、Race Conditions and Secure File OperationsをSecure Coding Guideで見てください。

source: For more information on file-system utilities, see Low-Level File Management Programming Topics.
ja: ファイルシステム・ユーティリティに関する詳細情報として、Low-Level File Management Programming Topicsを見てください。

source: For more information on toll-free bridging, see Toll-Free Bridging.
ja: トールフリーブリッジに関する更なる情報としてトールフリーブリッジを見てください。

source: For more information on transactions, see the description for apple Event(with Event Class: event ID: target Descriptor: return ID: transaction ID:).
ja: トランザクションに関するさらなる情報として、apple Event(with Event Class: event ID: target Descriptor: return ID: transaction ID:)に対する記述を見てください。

source: For more information, see Formatter.
ja: さらなる情報として、Formatterを見てください。

source: For more information, see NSRect Edge.
ja: 詳細は、NSRect Edgeを見てください。

source: For more information, see Defining the Service’s Protocol.
ja: 詳細は、サービスのプロトコルを定義するを見てください。

source: For more information, see Number and Value Programming Topics.
ja: 詳細は、Number and Value Programming Topicsを見てください。

source: For more information, see Technical Q&A QA1480 “NSDateFormatter and Internet Dates”.
ja: さらなる情報のために、Technical Q&A QA1480 “NSDateFormatter and Internet Dates”を見てください。

source: For more information, see App Icons on iPhone, iPad and Apple Watch.
ja: さらなる情報として、App Icons on iPhone, iPad and Apple Watchを見てください。

source: For more information, see HFS File Types.
ja: 詳細は、HFS File Typesを見てください。

source: For more information, see the “Performance Tips” section of the ICU User Guide.
ja: さらなる情報として、ICUユーザガイドの“Performance Tips”の節をみてください。

source: For more information, see umask.
ja: さらなる情報として、umaskを見てください。

source: For most fixed formats, you should also set the locale property to a POSIX locale ("en_US_POSIX"), and set the time Zone property to UTC.
ja: 最も固定された書式設定のために、あなたはまたlocaleプロパティをPOSIXロケール（"en_US_POSIX"）に設定すべきです、そしてtime ZoneプロパティをUTCに設定すべきです。

source: For multithreaded applications running in OS X v10.2.8 and earlier, notifications are delivered to the thread that first used the distributed notifications API, which in most cases is the main thread.
ja: OS X v10.2.8以前で動作しているマルチスレッドアプリケーションに対して、通知は、最初に分散通知APIを使ったスレッド、ほとんどの場合メインスレッド、に配達されます。

source: For multithreaded applications running in macOS 10.3 and later, distributed notifications are always delivered to the main thread.
ja: macOS 10.3以降で動作しているマルチスレッドアプリケーションに対して、分散通知は常にメインスレッドに配達されます。

source: For non-loadable bundles (applications and frameworks), if the principal class is not specified in the property list, this property is nil.
ja: ロード不可能なバンドル（アプリケーションとフレームワーク）に対して、プリンシパルクラスがプロパティリストにおいて指定されないならば、このプロパティはnilを返します。

source: For other collections the counters may be out of range or of the wrong type to use as an index.
ja: 他のコレクションに対してこれらのカウンタは、インデックスとして使うのには範囲外または間違った型になるでしょう。

source: For performance reasons, NSFile Wrapper may not read the contents of some file packages immediately even when this option is chosen.
ja: 性能上の理由のために、NSFile Wrapperはいくつかのファイルパッケージの内容をすぐに読み出さないでしょう、このオプションが選択される場合にさえ。

source: For possible values, see Date Formatter .Behavior.
ja: 可能な値としては、Date Formatter .Behaviorを見てください。

source: For possible values, see Date Formatter .Style.
ja: 可能な値としては、Date Formatter .Styleを見てください。

source: For possible values, see NSBinary Searching Options.
ja: 可能な値としては、NSBinary Searching Optionsを見てください。

source: For possible values, see NSKey Value Observing Options.
ja: 可能な値としては、NSKey Value Observing Optionsを見てください。

source: For related information, see How Cocoa Applications Handle Apple Events
ja: 関連した情報として、どのようにCocoaアプリケーションはアップルイベントを取り扱うかを見てください。

source: For resources in a specific subdirectory, you can also specify that directory.
ja: 特定の下位ディレクトリの中のリソースに対して、あなたはまたそのディレクトリも指定できます。

source: For sdef-declared scriptability, however, the types of the passed-in objects reliably match the relevant sdef declarations.
ja: sdefで宣言されるスクリプト対応機能情報にとっては、しかしながら、渡されたオブジェクトの型は期待通りに関係するsdef宣言部分と一致します。

source: For sockets, pipes, and devices, you can use a file handle object to monitor the device and process data asynchronously.
ja: ソケット、パイプ、そしてデバイスに対して、あなたはファイルハンドルオブジェクトを使ってデバイスの監視およびデータ処理が非同期に可能です。

source: For the NSFile Posix Permissions value, specify a file mode from the OR’d permission bit masks defined in sys/stat .h.
ja: NSFile Posix Permissions値に対して、sys/stat .hで定義されるOR演算される権限ビットマスクからファイルモードを指定します。

source: For the Shipping Options declaration, see the Option Set protocol discussion.
ja: Shipping Options宣言については、Option Setプロトコル解説を見てください。

source: For this backing store you can use a static array, a standard NSArray object, or some other data type or mechanism.
ja: このバッキングストアに対してあなたは、静的配列、標準的NSArrayオブジェクト、または何か他のデータ型もしくは仕組みを使うことができます。

source: For this condition to be true, b Rect cannot be empty, and must not extend beyond a Rect in any direction.
ja: この条件がtrueになるには、b Rectが空であることはできません、そしてa Rectを越えてどの方向にも拡大してはいけません。

source: For thorough discussions of scale and rounding Mode, see NSDecimal Number Behaviors.
ja: scaleとrounding Modeの通した解説として、NSDecimal Number Behaviorsを見てください。

source: For times, this style displays hours and minutes using a format appropriate for the current locale.
ja: 時刻に対して、このスタイルは、時と分を、現在のロケールに適切な書式設定を使って表示します。

source: For times, this style displays hours, minutes, and seconds using a format appropriate for the current locale.
ja: 時刻に対して、このスタイルは、時、分、そして秒を、現在のロケールに適切な書式設定を使って表示します。

source: For times, this style displays hours, minutes, seconds, and the spelled-out time zone information using a format appropriate for the current locale.
ja: 時刻に対して、このスタイルは、時、分、秒、そして完全綴りのタイムゾーン情報を、現在のロケールに適切な書式設定を使って表示します。

source: For times, this style displays hours, minutes, seconds, and time zone information using a format appropriate for the current locale.
ja: 時刻に対して、このスタイルは、時、分、秒、そしてタイムゾーン情報を、現在のロケールに適切な書式設定を使って表示します。

source: For user-visible representations of dates and times, Date Formatter provides a variety of localized presets and configuration options.
ja: ユーザの見ることができる日付と時刻の表現に対して、Date Formatterは様々なローカライズされた事前設定や構成設定オプションを提供します。

source: For user-visible representations, you should use the date Style and time Style properties, or the set Localized Date Format From Template(_:) method if your desired format cannot be achieved using the predefined styles; both of these properties and this method provide a localized date representation appropriate for display to the user.
ja: ユーザが見ることができる表現のために、あなたはdate Styleとtime Styleプロパティを、またはあなたの望む書式設定が前もって定義されたスタイルを使って達成されることができないならばset Localized Date Format From Template(_:)メソッドを使うべきです； これらのプロパティの療法とこのメソッドは、ユーザに表示するのに適切にローカライズされた日付表現を提供します。

source: Format
ja: 書式設定

source: Format number1 and number2 so that they have equal exponents.
ja: number1とnumber2をフォーマットしてください、そうするとそれらは等しい指数を持ちます。

source: Formats number so that calculations using it will take up as little memory as possible.
ja: 数をフォーマットしてください、それでそれを使う計算は、可能な限り小さなメモリをとります。

source: Formatting Energy Strings
ja: エネルギー文字列を書式設定する

source: Formatting Values
ja: 書式設定値

source: Formatting a String
ja: 文字列を書式設定する

source: Formatting constants for when values contain zeroes.
ja: 値がゼロを含む場合に対する書式設定定数。

source: Formatting styles for individual date and time values.
ja: 個々の日付と時刻値に対する書式設定スタイル。

source: Forwarding Messages
ja: メッセージの転送

source: Foundation Constants
ja: Foundation定数

source: Foundation Data Types
ja: Foundationデータ型

source: Foundation Enumerations
ja: Foundation列挙

source: Foundation types use Character Set to group characters together for searching operations, so that they can find any of a particular set of characters during a search.
ja: Foundation型は、Character Setを使うことで、検索操作のためにいくらかの文字を一緒にグループにまとめます、それでそれらは何らかの特定の一揃いの文字を検索の間に見つけることができます。

source: Foundation-only programs may have occasional need to use this method.
ja: Foundationのみのプログラムは、時折このメソッドを使う必要があるかもしれません。

source: Fractional units may be used when a value cannot be exactly represented using the available units.
ja: ある値が利用可能な単位を使って正確に表されることができない時に、小数の単位が使われるかもしれません。

source: Framework
ja: フレームワーク

source: Free-format comment (?# comment ).
ja: 自由な形式のコメント(?# comment )。

source: From Protocol
ja: 由来プロトコル

source: From one to six hex digits may be supplied.
ja: １から６桁までの16進数が、供給されることができます。

source: From the current read index, take up to the number of bytes specified in the second parameter from the stream and place them in the client-supplied buffer (first parameter).
ja: 現在の読み出しインデックスから、２番目のパラメータにおいて指定されるバイト数までストリームから取り上げて、それらをクライアントに提供されるバッファ（第１パラメータ）の中に置きます。

source: Functions
ja: 関数

source: Functions and data structures that comprise the Objective-C runtime, which provides support for the dynamic properties of the Objective-C language
ja: 関数およびデータ構造体で、Objective-Cランタイムを構成するもの、それはObjective-C言語の動的プロパティに対するサポートを提供します

source: Fundamentals
ja: 基本

source: Gain low-level access to the Objective-C runtime and the Objective-C root types.
ja: Objective-CランタイムとObjective-Cルート型への低水準アクセスを獲得します。

source: Garbage collection is deprecated in OS X v10.8; instead,you should use AutomaticReference Counting—see Transitioning to ARC Release Notes.
ja: ガベージコレクションはOS X v10.8で非推奨にされます；代わりに、あなたは自動参照カウントを使うべきです — Transitioning to ARC Release Notesを見てください。

source: General iCloud File Errors
ja: 一般iCloudファイルエラー

source: Generic Constraints
ja: 総称体制約

source: Generic Instance Method
ja: 総称体インスタンスメソッド

source: Get low-level support for basic Objective-C features, Cocoa design patterns, and Swift integration.
ja: 基本的なObjective-C機能、Cocoaデザインパターン、およびSwift統合のローレベルサポートをします。

source: Get the NSXPCConnection object from the service.
ja: NSXPCConnectionオブジェクトをこのサービスから得てください。

source: Get the proxy from the connection’s remote Object Proxy property.
ja: 接続のremote Object Proxyプロパティからプロキシを得てください。

source: Getting AM and PM symbols
ja: AM および PM シンボルを得る

source: Getting Bundle Information
ja: バンドル情報を取得する

source: Getting C Strings
ja: C文字列を扱う

source: Getting Calendar Information
ja: カレンダー情報を取得する

source: Getting Character Sets for URL Encoding
ja: URLエンコーディングのための文字集合を得る

source: Getting Characters and Bytes
ja: 文字とバイトを取得する

source: Getting Classes from a Bundle
ja: バンドルからクラスを取得する

source: Getting Distributed Notification Centers
ja: 分散通知センターを取得する

source: Getting Era Symbols
ja: 紀元シンボルを得る

source: Getting File and Directory Attributes
ja: ファイルおよびディレクトリ属性を取得する

source: Getting HTTP Response Headers
ja: HTTPレスポンスヘッダを取得する

source: Getting Host Information
ja: ホスト情報を得る

source: Getting Information About a Descriptor
ja: 記述子についての情報を取得する

source: Getting Information About a Script
ja: スクリプトについての情報を得る

source: Getting Localization Information
ja: ローカライズされた情報の取得

source: Getting Month Symbols
ja: 月シンボルを得る

source: Getting Object Values for Textual Representations
ja: テキスト表現に対するオブジェクト値を得る

source: Getting Particular Decimals
ja: 特定の10進数を得る

source: Getting Quarter Symbols
ja: 四半期シンボルを得る

source: Getting Response Status Code
ja: 応答状態コードを得る

source: Getting Standard Bundle Objects
ja: 標準バンドルオブジェクトを取得する

source: Getting Standard Character Sets
ja: 標準文字集合を取得する

source: Getting Temporal Boundaries
ja: 時間的な境界を得る

source: Getting Textual Representations of Object Values
ja: オブジェクト値のテキスト表現を得る

source: Getting Time Intervals
ja: 時間の隔たりを得る

source: Getting Weekday Symbols
ja: 曜日シンボルを得る

source: Getting a Decimal's Characteristics
ja: 10進数のもつ特徴を取得する

source: Getting a File Descriptor
ja: ファイル指定子を所得する

source: Getting a File Handle
ja: ファイルハンドルを取得する

source: Getting a Range-Based View
ja: 範囲に基づくビューを取得する

source: Getting an event manager
ja: イベントマネージャの取得

source: Getting and Comparing File Contents
ja: ファイル内容の取得と比較

source: Getting and Setting Attributes
ja: 属性の取得と設定

source: Getting and Setting the Cookie Accept Policy
ja: クッキー受入方針の取得と設定

source: Getting cached URL response properties
ja: キャッシュされたURL応答プロパティの取得

source: Getting cookie properties
ja: クッキープロパティを取得する

source: Getting the Identity Transform
ja: 恒等変換を取得する

source: Getting the Regular Expression and Options
ja: 正規表現とオプションを得る

source: Getting the Relationship Between Items
ja: 項目間の関係を取得する

source: Getting the Shared Cookie Storage Object
ja: 共有クッキーストレージオブジェクトを取得する

source: Getting the Standard Bundle Directories
ja: 標準バンドルディレクトリを取得する

source: Getting the User's Calendar
ja: ユーザの持つカレンダーの取得。

source: Given an Array (an array of NSNumber objects) and a comparison function of this type:
ja: an Array（NSNumberオブジェクトの配列）と、この型の比較関数を与えられて：

source: Given a current date of January 16, 2015, Configuring the Formatter Options shows how to configure a formatter object and generate the string “1/16/15 - 1/17/15”.
ja: January 16, 2015の現在の日付を与えられて、Configuring the Formatter Optionsは、フォーマッタオブジェクトを構成設定する、そして文字列 “1/16/15 - 1/17/15” を生成する方法を示します。

source: Given a nonzero suspension ID returned by an invocation of suspend Current Apple Event(), returns the corresponding reply event descriptor.
ja: 非ゼロのsuspension IDがsuspend Current Apple Event()の発動によって返されて指定されることで、該当する返答イベント記述子を返します。

source: Given a nonzero suspension ID returned by an invocation of suspend Current Apple Event(), returns the descriptor for the event whose handling was suspended.
ja: 非ゼロのsuspension IDがsuspend Current Apple Event()の発動によって返されて指定されることで、取り扱いが休止されたイベントに対する記述子を返します。

source: Given a nonzero suspension ID returned by an invocation of suspend Current Apple Event(), sets the values that will be returned by subsequent invocations of current Apple Event and current Reply Apple Event to be the event whose handling was suspended and its corresponding reply event, respectively.
ja: 非ゼロのsuspension IDがsuspend Current Apple Event()の発動によって返されて指定されることで、すぐ後に起こるcurrent Apple Eventとcurrent Reply Apple Eventの発動によって返される値を、それぞれ処理が休止されたイベントおよびそれの該当する返答イベントになるように設定します。

source: Given a nonzero suspension ID returned by an invocation of suspend Current Apple Event(), signal that handling of the suspended event may now continue.
ja: 非ゼロのsuspension IDがsuspend Current Apple Event()の発動によって返されて指定されることで、休止されたイベントの取り扱いが今続きを行われるように合図します。

source: Given an object specifier, returns the specified object or objects in the receiving container.
ja: あるオブジェクト指定子を与えられて、受け取っているコンテナの中の指定されたオブジェクトまたは複数のオブジェクトを返します。

source: Given the following function:
ja: 以下の関数を与えられて：

source: Global (nonlocalized) resources
ja: グローバル（ローカライズされない）リソース

source: Global resources—that is, resources not in a language-specific .lproj directory—are returned first, followed by region- and language-specific resources.
ja: グローバルリソース — すなわち、ある言語特有の.lprojディレクトリの中にないリソース — は、最初に返されます、その後に地域そして言語特有のリソースが続きます。

source: Groups the included pattern, but does not provide capturing of matching text.
ja: 含まれるパターンをグループにします、しかしマッチしているテキストの捕獲を提供しません。

source: HFS File Type Functions
ja: HFSファイルタイプ関数

source: HTTP headers are case insensitive.
ja: HTTPヘッダは、大文字小文字を無視します。

source: Handles messages the receiver doesn’t recognize.
ja: レシーバが認識できないメッセージを取り扱います。

source: Handling Errors in Swift:
ja: Swiftでのエラー処理：

source: Here are a few possibilities:
ja: ここに少しばかりの可能性があります：

source: Here's the JSON object that results from the custom encoding above:
ja: 上のあつらえのエンコーディングの結果であるJSONオブジェクトがあります：

source: Here, a set of strings is created from an array literal holding only strings:
ja: ここでは、文字列の集合が文字列のみを保持する配列リテラルから作成されます：

source: Here’s an example of creating an array initialized with five strings containing the letter Z.
ja: ここに、字Zを含んでいる５つの文字列で初期化される配列を作成する例があります。

source: Here’s an example of inserting a range of integers into an array of the same type:
ja: ここに整数の範囲を同じ型の配列へ挿入する例があります：

source: Here’s an example of sorting a list of students’ names.
ja: ここに、生徒名のリストをソートする例があります。

source: Here’s an example that finds a student name that begins with the letter “A”:
ja: ここに、文字「A」で始まる生徒名を見つける例があります：

source: Host App Interaction
ja: ホストアプリ相互作用

source: Host to compare the receiver to.
ja: レシーバと比較するホスト。

source: However, NSBackground Activity Scheduler gives the system flexibility to determine the most efficient time to execute based on energy usage, thermal conditions, and CPU use.
ja: しかしながら、NSBackground Activity Schedulerは、システムに柔軟性を与えて、最も効率的な時を判定して、エネルギー使用、温度条件、そしてCPU利用に基づいて実行します。

source: However, Cocoa applications have full access to the Apple Event Manager C APIs for working with Apple events.
ja: しかしながら、Codoaアプリケーションはアップルイベントを扱うために「アップルイベントマネージャーC API」への完全なアクセスを持ちます。

source: However, for some regular expressions (though not the example pattern) some capture groups may or may not participate in a given match.
ja: しかし、若干の正規表現では（例パターンはそうでないけれども）、一部の捕獲グループが、ある与えられたマッチに関与するかもしれないし、しないかもしれません。

source: However, if error is nil, the sender is not interested in the error description, and you should not attempt to assign one.
ja: しかしながら、errorがnilならば、送り手はエラー解説に興味がありません、そしてあなたはそれを割り当てようとすべきではありません。

source: However, if a new file system object is required, the URL object may be different.
ja: しかしながら、新しいファイルシステムオブジェクトが必要とされるならば、URLオブジェクトは異なるでしょう。

source: However, if another file wrapper with the same preferred name already exists in the directory file wrapper when this object is added, the filename assigned as the dictionary key may differ from the preferred filename.
ja: しかしながら、別のファイルラッパーが同じ優先名で既にディレクトリフィイルラッパー中にこのオブジェクトが追加される時に存在するならば、ディレクトリキーとして割り当てられるファイル名は優先名と異なるかもしれません。

source: However, if the delegate stops the operation for a directory, this method returns false.
ja: 委任先が、ディレクトリに対する操作を停止するならば、このメソッドはfalseを返します。

source: However, if the initial lookup of an already loaded and cached bundle with the specified identifier fails, this method uses potentially time-consuming heuristics to attempt to locate the bundle.
ja: しかしながら、指定された識別子での既にロードされてキャッシュされたバンドルの最初の検索が失敗するならば、このメソッドは潜在的に時間がかかる発見方法を使ってバンドルを捜し出すことを試みます。

source: However, if you use a delegate to receive notifications about the status of move, copy, remove, and link operations, you should create a unique instance of the file manager object, assign your delegate to that object, and use that file manager to initiate your operations.
ja: しかしながら、あなたが移動、コピー、除去、そしてリンク操作の状況についての通知を受け取るのに委任先を使うならば、あなたはファイルマネージャオブジェクトのある固有のインスタンスを作成して、そのオブジェクトにあなたの委任先の役を割り当てて、そしてそのファイルマネージャを使ってあなたの操作を開始するべきです。

source: However, it is unlikely that you will need to create a subclass of NSApple Event Descriptor.
ja: しかしながら、あなたがNSApple Event Descriptorのサブクラスの作成を必要とすることは起こりそうもありません。

source: However, neither 356 or 366 divide evenly into a 7 day week, so it is often the case that the last week of a year ends on a day in the next year, and the first week of a year begins in the preceding year.
ja: しかしながら、356または366のどちらも均一に７日週へと分割されません、それでしばしばある年の最後の週が次の年のある日で終わる、そしてある年の最初の週が前の年に始まる場合があります。

source: However, note that reading with both options together is expensive in terms of both I/O and memory for large files, or directories containing large files, or even directories containing many small files.
ja: しかしながら、両方のオプションを一緒に持つ読み出しは、I/O及びメモリの両方の観点から巨大なファイル、または巨大なファイルを含むディレクトリ、または多くの小さなファイルを含むディレクトリに対してさえ高くつくことに注意してください。

source: However, some applications may want to perform more basic Apple event handling, in which an application registers handlers for the Apple events it can process, then calls on the Apple Event Manager to dispatch received Apple events to the appropriate handler.
ja: しかしながら、いくつかのアプリケーションはもっと基本的なアップルイベントの取り扱いを行うことを望むかもしれません、そのようなアプリケーションでは、それが処理可能ないくらかのアップルイベントに対してのハンドラを登録します、それから受け取ったアップルイベントを適切なハンドラーへと発送（ディスパッチ）するようにアップルイベントマネージャに頼みます。

source: However, the handler should not fill out the reply if the descriptor type for the reply event is type Null, indicating the sender does not want a reply.
ja: しかしながら、返答イベントに対する記述子型が、セレクタが返答を望まないことを示すtype Nullであるならば、ハンドラーは返答に応じるべきではありません。
